"""
Создайте в Sublime файл info.py
Запишите в переменную user_info словарь с полями first_name и last_name, в значениях запишите ваши имя и фамилию
Выведете на экран значение ключа first_name переменной user_info
Запустите скрипт
"""

user_info = {'first_name': 'Алексей', 'last_name': 'Кошик'}
print(user_info['first_name'])
input()
